#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-993995983]
module.db_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3907084948]
module.ecs_service_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2445190106]
module.ecs_service_sg.aws_security_group.sg: Refreshing state... [id=sg-0765e9b21f27b9a87]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4212506818]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1073499807]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1671588254]
module.db_sg.aws_security_group.sg: Refreshing state... [id=sg-0423e1186fb5c7a4a]
module.https_sg.aws_security_group.sg: Refreshing state... [id=sg-09157ae42a7ec22ca]
module.ecs_service_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-133425637]
module.cloudwatch_logs.aws_cloudwatch_log_group.logs: Refreshing state... [id=/machamp/staging/ecs]
module.http_sg.aws_security_group.sg: Refreshing state... [id=sg-068c5d2fcd746ab57]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.rds.aws_db_option_group.this: Refreshing state... [id=machamp-staging]
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-09d8ac12538411d38]
module.rds.aws_db_parameter_group.this: Refreshing state... [id=machamp-staging]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.ecs.module.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-task-execution]
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=staging]
module.ecs.module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::762742784206:policy/ecs-task-execution]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20210530141349119800000001]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-04c459391a247e0ab]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0320d2046da4cfbfb]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-09fd540a6c087b413]
module.network.aws_route_table.public: Refreshing state... [id=rtb-01aa3ece37c6487e0]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-0f47b5557a518ee32]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-078207bd7321b1695]
module.db_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2707013247]
module.network.aws_route.public: Refreshing state... [id=r-rtb-01aa3ece37c6487e01080289494]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-095bf430a13fe6780]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0399fe76182b6078f]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/8a1895f7f9c91409]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=machamp-staging-subnet-group]
module.rds.aws_db_instance.this: Refreshing state... [id=machamp-staging-db]
module.alb.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/example/0ae2b131cf2341a9]
module.ecs.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/8a1895f7f9c91409/f1a4bee2a08032c5]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb.alb will be updated in-place
  ~ resource "aws_lb" "alb" {
        id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/8a1895f7f9c91409"
        name                       = "machamp-staging-alb"
      ~ security_groups            = [
          - "sg-068c5d2fcd746ab57",
          - "sg-09157ae42a7ec22ca",
        ] -> (known after apply)
        tags                       = {}
        # (14 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.alb_sg.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "machamp-staging-alb-sg"
        }
      + tags_all               = {
          + "Name" = "machamp-staging-alb-sg"
        }
      + vpc_id                 = "vpc-09d8ac12538411d38"
    }

  # module.alb_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "http"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "https"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.db_sg.aws_security_group.sg will be destroyed
  - resource "aws_security_group" "sg" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:762742784206:security-group/sg-0423e1186fb5c7a4a" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0423e1186fb5c7a4a" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3306
            },
        ] -> null
      - name                   = "mysql-sg" -> null
      - owner_id               = "762742784206" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "machamp-staging-mysql-sg"
        } -> null
      - tags_all               = {
          - "Name" = "machamp-staging-mysql-sg"
        } -> null
      - vpc_id                 = "vpc-09d8ac12538411d38" -> null
    }

  # module.db_sg.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "mysql-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "machamp-staging-mysql-sg"
        }
      + tags_all               = {
          + "Name" = "machamp-staging-mysql-sg"
        }
      + vpc_id                 = "vpc-09d8ac12538411d38"
    }

  # module.db_sg.aws_security_group_rule.egress must be replaced
-/+ resource "aws_security_group_rule" "egress" {
      ~ id                       = "sgrule-2707013247" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0423e1186fb5c7a4a" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.db_sg.aws_security_group_rule.ingress will be destroyed
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "10.0.0.0/16",
        ] -> null
      - from_port         = 3306 -> null
      - id                = "sgrule-3907084948" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0423e1186fb5c7a4a" -> null
      - self              = false -> null
      - to_port           = 3306 -> null
      - type              = "ingress" -> null
    }

  # module.db_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.ecs.aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service"
        name                               = "machamp-staging-service"
        tags                               = {}
        # (15 unchanged attributes hidden)




      ~ network_configuration {
          ~ security_groups  = [
              - "sg-0765e9b21f27b9a87",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (3 unchanged blocks hidden)
    }

  # module.ecs_service_sg.aws_security_group.sg will be destroyed
  - resource "aws_security_group" "sg" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:762742784206:security-group/sg-0765e9b21f27b9a87" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0765e9b21f27b9a87" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "ecs_service_sg" -> null
      - owner_id               = "762742784206" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "machamp-staging-ecs_service_sg"
        } -> null
      - tags_all               = {
          - "Name" = "machamp-staging-ecs_service_sg"
        } -> null
      - vpc_id                 = "vpc-09d8ac12538411d38" -> null
    }

  # module.ecs_service_sg.aws_security_group_rule.egress will be destroyed
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-133425637" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0765e9b21f27b9a87" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.ecs_service_sg.aws_security_group_rule.ingress will be destroyed
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "10.0.0.0/16",
        ] -> null
      - from_port         = 80 -> null
      - id                = "sgrule-2445190106" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0765e9b21f27b9a87" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.ecs_task_sg.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ecs_service_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "machamp-staging-ecs_service_sg"
        }
      + tags_all               = {
          + "Name" = "machamp-staging-ecs_service_sg"
        }
      + vpc_id                 = "vpc-09d8ac12538411d38"
    }

  # module.ecs_task_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs_task_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.http_sg.aws_security_group.sg will be destroyed
  - resource "aws_security_group" "sg" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:762742784206:security-group/sg-068c5d2fcd746ab57" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-068c5d2fcd746ab57" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "http-sg" -> null
      - owner_id               = "762742784206" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "machamp-staging-http-sg"
        } -> null
      - tags_all               = {
          - "Name" = "machamp-staging-http-sg"
        } -> null
      - vpc_id                 = "vpc-09d8ac12538411d38" -> null
    }

  # module.http_sg.aws_security_group_rule.egress will be destroyed
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-4212506818" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-068c5d2fcd746ab57" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.http_sg.aws_security_group_rule.ingress will be destroyed
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 80 -> null
      - id                = "sgrule-1671588254" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-068c5d2fcd746ab57" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.https_sg.aws_security_group.sg will be destroyed
  - resource "aws_security_group" "sg" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:762742784206:security-group/sg-09157ae42a7ec22ca" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-09157ae42a7ec22ca" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "https-sg" -> null
      - owner_id               = "762742784206" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "machamp-staging-https-sg"
        } -> null
      - tags_all               = {
          - "Name" = "machamp-staging-https-sg"
        } -> null
      - vpc_id                 = "vpc-09d8ac12538411d38" -> null
    }

  # module.https_sg.aws_security_group_rule.egress will be destroyed
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-1073499807" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-09157ae42a7ec22ca" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.https_sg.aws_security_group_rule.ingress will be destroyed
  - resource "aws_security_group_rule" "ingress" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 443 -> null
      - id                = "sgrule-993995983" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-09157ae42a7ec22ca" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "ingress" -> null
    }

  # module.rds.aws_db_instance.this will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "machamp-staging-db"
        tags                                  = {}
      ~ vpc_security_group_ids                = [
          - "sg-0423e1186fb5c7a4a",
        ] -> (known after apply)
        # (44 unchanged attributes hidden)
    }

Plan: 10 to add, 3 to change, 12 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>